text2midi/app/controllers/chords_controller.rb

SELECT * FROM "chords" WHERE ("chords"."id" = 953125641)
---
  def show
    @chord = Chord.find(params[:id])

SELECT * FROM "chords" WHERE ("chords"."id" = 953125641)
---
  def edit
    @chord = Chord.find(params[:id])

INSERT INTO "chords" ("name", "updated_at", "pattern", "created_at") VALUES(NULL, '2009-01-27 03:32:47', NULL, '2009-01-27 03:32:47')
---
  def create
    @chord = Chord.new(params[:chord])

    respond_to do |format|
      if @chord.save

SELECT * FROM "chords" WHERE ("chords"."id" = 953125641)
---
  def update
    @chord = Chord.find(params[:id])

SELECT * FROM "chords" WHERE ("chords"."id" = 953125641)
DELETE FROM "chords" WHERE "id" = 953125641
---
  def destroy
    @chord = Chord.find(params[:id])
    @chord.destroy