text2midi/app/controllers/scales_controller.rb

SELECT * FROM "scales" WHERE ("scales"."id" = 953125641)
---
  def show
    @scale = Scale.find(params[:id])

SELECT * FROM "scales" WHERE ("scales"."id" = 953125641)
---
  def edit
    @scale = Scale.find(params[:id])

INSERT INTO "scales" ("name", "updated_at", "pattern", "created_at") VALUES(NULL, '2009-01-27 03:32:47', NULL, '2009-01-27 03:32:47')
---
  def create
    @scale = Scale.new(params[:scale])

    respond_to do |format|
      if @scale.save

SELECT * FROM "scales" WHERE ("scales"."id" = 953125641)
---
  def update
    @scale = Scale.find(params[:id])

SELECT * FROM "scales" WHERE ("scales"."id" = 953125641)
DELETE FROM "scales" WHERE "id" = 953125641
---
  def destroy
    @scale = Scale.find(params[:id])
    @scale.destroy